Revit 2027 API
TransactWithCentralOptions.SetLockCallback Method
 Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLockCallback(
	ICentralLockedCallback lockCallback
)
Public Sub SetLockCallback (
	lockCallback As ICentralLockedCallback
)
public:
void SetLockCallback(
	ICentralLockedCallback^ lockCallback
)
member SetLockCallback :
        lockCallback : ICentralLockedCallback -> unit
Parameters
lockCallback ICentralLockedCallback
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace